<!-- dflook/terraform-github-actions {"workspace":"main","backend_type":"remote","backend":"5f8ff10368640277dd2aa4ae90eb01cd81dce98824f81d9a032177517b2c133c","plan_job_ref":"Job Terraform Plan #23 at https://github.com/jaxxstorm/tailscale-actions-example/actions/runs/9829761832","plan_out_hash":"50574a4563bc5a06f4c7a466803d8d101469f27c297b1a2d748426d0c8ea10ed","plan_hash":"e2a5b8733f499cf9c6cd82020b1c883ab978fe0b581d46ddc8b653dcf77f6cd1","plan_text_format":"diff-trunc","version":"1.43.0","closed":true} -->
Terraform plan in __.__ in the __main__ workspace
<details>
<summary>Plan: 162 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_route_tables.vpc-dev will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route_tables" "vpc-dev" {
+       id     = (known after apply)
+       ids    = (known after apply)
+       tags   = (known after apply)
+       vpc_id = (known after apply)
    }

  # data.aws_route_tables.vpc-prod will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route_tables" "vpc-prod" {
+       id     = (known after apply)
+       ids    = (known after apply)
+       tags   = (known after apply)
+       vpc_id = (known after apply)
    }

  # data.aws_route_tables.vpc-shared will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route_tables" "vpc-shared" {
+       id     = (known after apply)
+       ids    = (known after apply)
+       tags   = (known after apply)
+       vpc_id = (known after apply)
    }

  # aws_ec2_transit_gateway_vpc_attachment.dev will be created
+   resource "aws_ec2_transit_gateway_vpc_attachment" "dev" {
+       appliance_mode_support                          = "disable"
+       dns_support                                     = "enable"
+       id                                              = (known after apply)
+       ipv6_support                                    = "disable"
+       subnet_ids                                      = (known after apply)
+       tags                                            = {
+           "Name" = "tgw-dev"
        }
+       tags_all                                        = {
+           "Name" = "tgw-dev"
        }
+       transit_gateway_default_route_table_association = (known after apply)
+       transit_gateway_default_route_table_propagation = (known after apply)
+       transit_gateway_id                              = (known after apply)
+       vpc_id                                          = (known after apply)
+       vpc_owner_id                                    = (known after apply)
    }

  # aws_ec2_transit_gateway_vpc_attachment.prod will be created
+   resource "aws_ec2_transit_gateway_vpc_attachment" "prod" {
+       appliance_mode_support                          = "disable"
+       dns_support                                     = "enable"
+       id                                              = (known after apply)
+       ipv6_support                                    = "disable"
+       subnet_ids                                      = (known after apply)
+       tags                                            = {
+           "Name" = "tgw-prod"
        }
+       tags_all                                        = {
+           "Name" = "tgw-prod"
        }
+       transit_gateway_default_route_table_association = (known after apply)
+       transit_gateway_default_route_table_propagation = (known after apply)
+       transit_gateway_id                              = (known after apply)
+       vpc_id                                          = (known after apply)
+       vpc_owner_id                                    = (known after apply)
    }

  # aws_instance.dev will be created
+   resource "aws_instance" "dev" {
+       ami                                  = "ami-0075013580f6322a1"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = true
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name" = "lbr-subnet-router-dev"
        }
+       tags_all                             = {
+           "Name" = "lbr-subnet-router-dev"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (sensitive value)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification (known after apply)

+       cpu_options (known after apply)

+       ebs_block_device (known after apply)

+       enclave_options (known after apply)

+       ephemeral_block_device (known after apply)

+       instance_market_options (known after apply)

+       maintenance_options (known after apply)

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = "disabled"
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = "********"
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface (known after apply)

+       private_dns_name_options (known after apply)

+       root_block_device (known after apply)
    }

  # aws_instance.prod will be created
+   resource "aws_instance" "prod" {
+       ami                                  = "ami-0075013580f6322a1"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = true
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name" = "lbr-subnet-router-prod"
        }
+       tags_all                             = {
+           "Name" = "lbr-subnet-router-prod"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (sensitive value)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification (known after apply)

+       cpu_options (known after apply)

+       ebs_block_device (known after apply)

+       enclave_options (known after apply)

+       ephemeral_block_device (known after apply)

+       instance_market_options (known after apply)

+       maintenance_options (known after apply)

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = "disabled"
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = "********"
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface (known after apply)

+       private_dns_name_options (known after apply)

+       root_block_device (known after apply)
    }

  # aws_route.dev[0] will be created
+   resource "aws_route" "dev" {
+       destination_cidr_block = "172.20.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.dev[1] will be created
+   resource "aws_route" "dev" {
+       destination_cidr_block = "172.20.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.dev[2] will be created
+   resource "aws_route" "dev" {
+       destination_cidr_block = "172.20.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.dev[3] will be created
+   resource "aws_route" "dev" {
+       destination_cidr_block = "172.20.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.dev[4] will be created
+   resource "aws_route" "dev" {
+       destination_cidr_block = "172.20.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.dev-shared[0] will be created
+   resource "aws_route" "dev-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.dev-shared[1] will be created
+   resource "aws_route" "dev-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.dev-shared[2] will be created
+   resource "aws_route" "dev-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.dev-shared[3] will be created
+   resource "aws_route" "dev-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.dev-shared[4] will be created
+   resource "aws_route" "dev-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod[0] will be created
+   resource "aws_route" "prod" {
+       destination_cidr_block = "10.0.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod[1] will be created
+   resource "aws_route" "prod" {
+       destination_cidr_block = "10.0.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod[2] will be created
+   resource "aws_route" "prod" {
+       destination_cidr_block = "10.0.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod[3] will be created
+   resource "aws_route" "prod" {
+       destination_cidr_block = "10.0.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod[4] will be created
+   resource "aws_route" "prod" {
+       destination_cidr_block = "10.0.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod-shared[0] will be created
+   resource "aws_route" "prod-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod-shared[1] will be created
+   resource "aws_route" "prod-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod-shared[2] will be created
+   resource "aws_route" "prod-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod-shared[3] will be created
+   resource "aws_route" "prod-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_route.prod-shared[4] will be created
+   resource "aws_route" "prod-shared" {
+       destination_cidr_block = "192.168.0.0/16"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
+       transit_gateway_id     = (known after apply)
    }

  # aws_security_group.dev will be created
+   resource "aws_security_group" "dev" {
+       arn                    = (known after apply)
+       description            = "Tailscale required traffic"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all outbound traffic"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Tailscale access"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = (known after apply)
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.prod will be created
+   resource "aws_security_group" "prod" {
+       arn                    = (known after apply)
+       description            = "Tailscale required traffic"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all outbound traffic"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Tailscale access"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = (known after apply)
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.rds-dev will be created
+   resource "aws_security_group" "rds-dev" {
+       arn                    = (known after apply)
+       description            = "Allow inbound traffic to RDS"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "172.20.0.0/16",
                ]
+               description      = "Allow inbound from VPC"
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
            },
+           {
+               cidr_blocks      = [
+                   "192.168.0.0/16",
                ]
+               description      = "Allow inbound from VPC"
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = "rds-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "rds-sg"
        }
+       tags_all               = {
+           "Name" = "rds-sg"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.rds-prod will be created
+   resource "aws_security_group" "rds-prod" {
+       arn                    = (known after apply)
+       description            = "Allow inbound traffic to RDS"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "10.0.0.0/16",
                ]
+               description      = "Allow inbound from VPC"
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
            },
+           {
+               cidr_blocks      = [
+                   "192.168.0.0/16",
                ]
+               description      = "Allow inbound from VPC"
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = "rds-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "rds-sg"
        }
+       tags_all               = {
+           "Name" = "rds-sg"
        }
+       vpc_id                 = (known after apply)
    }

  # mysql_database.app-dev will be created
+   resource "mysql_database" "app-dev" {
+       default_character_set = "utf8mb4"
+       default_collation     = "utf8mb4_general_ci"
+       id                    = (known after apply)
+       name                  = "app"
    }

  # mysql_database.app-prod will be created
+   resource "mysql_database" "app-prod" {
+       default_character_set = "utf8mb4"
+       default_collation     = "utf8mb4_general_ci"
+       id                    = (known after apply)
+       name                  = "app"
    }

  # module.db-dev.random_password.master_password[0] will be created
+   resource "random_password" "master_password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.db-prod.random_password.master_password[0] will be created
+   resource "random_password" "master_password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.tgw.aws_ec2_tag.this["Name"] will be created
+   resource "aws_ec2_tag" "this" {
+       id          = (known after apply)
+       key         = "Name"
+       resource_id = (known after apply)
+       value       = "tgw-shared"
    }

  # module.tgw.aws_ec2_transit_gateway.this[0] will be created
+   resource "aws_ec2_transit_gateway" "this" {
+       amazon_side_asn                    = 64532
+       arn                                = (known after apply)
+       association_default_route_table_id = (known after apply)
+       auto_accept_shared_attachments     = "enable"
+       default_route_table_association    = "enable"
+       default_route_table_propagation    = "enable"
+       description                        = "LBR labs shared transit gateway"
+       dns_support                        = "enable"
+       id                                 = (known after apply)
+       multicast_support                  = "disable"
+       owner_id                           = (known after apply)
+       propagation_default_route_table_id = (known after apply)
+       tags                               = {
+           "Name" = "tgw-shared"
        }
+       tags_all                           = {
+           "Name" = "tgw-shared"
        }
+       vpn_ecmp_support                   = "enable"

+       timeouts {}
    }

  # module.tgw.aws_ec2_transit_gateway_route_table.this[0] will be created
+   resource "aws_ec2_transit_gateway_route_table" "this" {
+       arn                             = (known after apply)
+       default_association_route_table = (known after apply)
+       default_propagation_route_table = (known after apply)
+       id                              = (known after apply)
+       tags                            = {
+           "Name" = "tgw-shared"
        }
+       tags_all                        = {
+           "Name" = "tgw-shared"
        }
+       transit_gateway_id              = (known after apply)
    }

  # module.tgw.aws_ec2_transit_gateway_vpc_attachment.this["vpc-shared"] will be created
+   resource "aws_ec2_transit_gateway_vpc_attachment" "this" {
+       appliance_mode_support                          = "disable"
+       dns_support                                     = "enable"
+       id                                              = (known after apply)
+       ipv6_support                                    = "disable"
+       subnet_ids                                      = (known after apply)
+       tags                                            = {
+           "Name" = "tgw-shared"
        }
+       tags_all                                        = {
+           "Name" = "tgw-shared"
        }
+       transit_gateway_default_route_table_association = true
+       transit_gateway_default_route_table_propagation = true
+       transit_gateway_id                              = (known after apply)
+       vpc_id                                          = (known after apply)
+       vpc_owner_id                                    = (known after apply)
    }

  # module.tgw.aws_ram_principal_association.this[0] will be created
+   resource "aws_ram_principal_association" "this" {
+       id                 = (known after apply)
+       principal          = "565485516070"
+       resource_share_arn = (known after apply)
    }

  # module.tgw.aws_ram_principal_association.this[1] will be created
+   resource "aws_ram_principal_association" "this" {
+       id                 = (known after apply)
+       principal          = "780219548054"
+       resource_share_arn = (known after apply)
    }

  # module.tgw.aws_ram_resource_association.this[0] will be created
+   resource "aws_ram_resource_association" "this" {
+       id                 = (known after apply)
+       resource_arn       = (known after apply)
+       resource_share_arn = (known after apply)
    }

  # module.tgw.aws_ram_resource_share.this[0] will be created
+   resource "aws_ram_resource_share" "this" {
+       allow_external_principals = true
+       arn                       = (known after apply)
+       id                        = (known after apply)
+       name                      = "tgw-shared"
+       permission_arns           = (known after apply)
+       tags                      = {
+           "Name" = "tgw-shared"
        }
+       tags_all                  = {
+           "Name" = "tgw-shared"
        }
    }

  # module.vpc-dev.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Name" = "tgw-development-west-default"
        }
+       tags_all               = {
+           "Name" = "tgw-development-west-default"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       egress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       ingress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
    }

  # module.vpc-dev.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Name" = "tgw-development-west-default"
        }
+       tags_all               = {
+           "Name" = "tgw-development-west-default"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc-dev.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "tgw-development-west-default"
        }
+       tags_all               = {
+           "Name" = "tgw-development-west-default"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc-dev.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "tgw-development-west-us-west-2a"
        }
+       tags_all             = {
+           "Name" = "tgw-development-west-us-west-2a"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc-dev.aws_eip.nat[1] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "tgw-development-west-us-west-2b"
        }
+       tags_all             = {
+           "Name" = "tgw-development-west-us-west-2b"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc-dev.aws_eip.nat[2] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "tgw-development-west-us-west-2c"
        }
+       tags_all             = {
+           "Name" = "tgw-development-west-us-west-2c"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc-dev.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "tgw-development-west"
        }
+       tags_all = {
+           "Name" = "tgw-development-west"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc-dev.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "tgw-development-west-us-west-2a"
        }
+       tags_all                           = {
+           "Name" = "tgw-development-west-us-west-2a"
        }
    }

  # module.vpc-dev.aws_nat_gateway.this[1] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "tgw-development-west-us-west-2b"
        }
+       tags_all                           = {
+           "Name" = "tgw-development-west-us-west-2b"
        }
    }

  # module.vpc-dev.aws_nat_gateway.this[2] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "tgw-development-west-us-west-2c"
        }
+       tags_all                           = {
+           "Name" = "tgw-development-west-us-west-2c"
        }
    }

  # module.vpc-dev.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc-dev.aws_route.private_nat_gateway[1] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc-dev.aws_route.private_nat_gateway[2] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc-dev.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc-dev.aws_route_table.intra[0] will be created
+   resource "aws_route_table" "intra" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "tgw-development-west-intra"
        }
+       tags_all         = {
+           "Name" = "tgw-development-west-intra"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc-dev.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "tgw-development-west-private-us-west-2a"
        }
+       tags_all         = {
+           "Name" = "tgw-development-west-private-us-west-2a"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc-dev.aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "tgw-development-west-private-us-west-2b"
        }
+       tags_all         = {
+           "Name" = "tgw-development-west-private-us-west-2b"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc-dev.aws_route_table.private[2] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:white_check_mark: No changes to apply in [Terraform Apply #29](https://github.com/jaxxstorm/tailscale-actions-example/actions/runs/9832583862)
<details open><summary>Outputs</summary>

```hcl
dev_rds_endpoint  = "example.cosmtk3du4t4.us-west-2.rds.amazonaws.com"
prod_rds_endpoint = "example.cu48jjbzgv7x.us-west-2.rds.amazonaws.com"
```
</details>